dependencies/OpenFOAM/modules/OpenQBMM/tutorials/pbeTransportFoam/TaylorCouette/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "wedge.*"
    {
        type            wedge;
    }
    innerWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    outerWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    inlet
    {
        type            symmetry;
    }
    outlet
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
